Tekla Open API Reference for Tekla Structures 2025
GeometrySection.GeometryNode Property
 Gets the geometry node
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IGeometryNode GeometryNode { get; }
Public ReadOnly Property GeometryNode As IGeometryNode
	Get
Property Value
Type: IGeometryNode
See Also
Reference
GeometrySection Class
Tekla.Structures.Model Namespace